---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelLine
source: html/efa027df-571b-e8b6-670f-84404f181468.htm
---
# ModelLine Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.